Overload List
Name  |   Description
AddRule(RoutingPreferenceRuleGroupType, RoutingPreferenceRule)
 Adds a new routing preference rule to the rule group.
AddRule(RoutingPreferenceRuleGroupType, RoutingPreferenceRule, Int32)
 Adds a new routing preference rule to the specified position in the rule group.
 See Also
  RoutingPreferenceManager Class
  RoutingPreferenceManager Members
  Autodesk.Revit.DB Namespace